
{
  "sectionNumber": "02",
  "title": "Projects",
  "projects": [
    {
      "id": "nexfit",
      "title": "NexFit",
      "year": "2024",
      "description": "Fitness platform developed with microservice architecture. User management, exercise programming, and payment system integrations.",
      "technologies": ["Node.js", "React", "PostgreSQL", "Microservices", "Stripe API"],
      "blogContent": {
        "title": "Building NexFit: A Modern Fitness Platform",
        "publishDate": "2024-03-15",
        "readTime": "8 min read",
        "content": [
          {
            "type": "paragraph",
            "text": "The NexFit project is a comprehensive platform developed to meet the needs of the modern fitness industry. We created a scalable and modular solution using microservice architecture."
          },
          {
            "type": "heading",
            "text": "Technology Choices"
          },
          {
            "type": "paragraph",
            "text": "We used Node.js and Express.js for the backend, while choosing PostgreSQL as the database. We developed a modern user interface with React on the frontend."
          },
          {
            "type": "heading",
            "text": "Microservice Architecture"
          },
          {
            "type": "paragraph",
            "text": "We divided our system into four main microservices: user management, exercise programming, payment system, and reporting. This approach provided us with great flexibility."
          },
          {
            "type": "heading",
            "text": "Challenges We Faced"
          },
          {
            "type": "paragraph",
            "text": "One of the biggest challenges was optimizing inter-microservice communication. We solved this problem by using Redis cache system and API Gateway."
          }
        ]
      }
    },
    {
      "id": "atlas-ai",
      "title": "Atlas AI",
      "year": "2024", 
      "description": "Fully local, security-focused AI assistant. Privacy-preserving, customizable AI solution that protects user data.",
      "technologies": ["Python", "TensorFlow", "Electron", "Local LLM", "Privacy-First"],
      "blogContent": {
        "title": "Atlas AI: Privacy-First AI Assistant",
        "publishDate": "2024-02-20",
        "readTime": "6 min read",
        "content": [
          {
            "type": "paragraph",
            "text": "Atlas AI is an artificial intelligence assistant that maintains the highest level of user privacy and operates completely locally. This solution, where data is not sent to cloud servers, is ideal for corporate security requirements."
          },
          {
            "type": "heading",
            "text": "Privacy-Focused Design"
          },
          {
            "type": "paragraph",
            "text": "All AI computations are performed on the user's own device. No data is sent to external servers, ensuring complete privacy guarantee."
          },
          {
            "type": "heading",
            "text": "Technical Infrastructure"
          },
          {
            "type": "paragraph",
            "text": "We developed optimized local LLM models using Python and TensorFlow. We created a cross-platform desktop application with Electron."
          }
        ]
      }
    },
    {
      "id": "nexpanel",
      "title": "NexPanel",
      "year": "2023",
      "description": "Customizable modular management system with multi-tenant panel architecture. Scalable infrastructure for SaaS products.",
      "technologies": ["Next.js", "TypeScript", "Multi-tenant", "Modular Architecture"],
      "blogContent": {
        "title": "NexPanel: Modular SaaS Management System",
        "publishDate": "2023-11-10",
        "readTime": "10 min read",
        "content": [
          {
            "type": "paragraph",
            "text": "NexPanel is a modular and multi-tenant management panel system developed for SaaS products. It stands out with its customizable structure according to different customer needs."
          },
          {
            "type": "heading",
            "text": "Multi-Tenant Architecture"
          },
          {
            "type": "paragraph",
            "text": "We designed an intelligent architecture where each customer has their own isolated environment but shares the same codebase."
          },
          {
            "type": "heading",
            "text": "Modular Structure"
          },
          {
            "type": "paragraph",
            "text": "The system consists of modules that can be activated/deactivated according to customer needs. This way, each customer uses only the features they need."
          }
        ]
      }
    },
    {
      "id": "nexcv-nexbook",
      "title": "NexCV & NexBook",
      "year": "2023",
      "description": "AI-powered CV builder and appointment management system. Customer-focused solutions with SaaS model.",
      "technologies": ["React", "AI/ML", "SaaS", "Customer Management"],
      "blogContent": {
        "title": "NexCV & NexBook: AI-Powered Business Solutions",
        "publishDate": "2023-09-05",
        "readTime": "7 min read",
        "content": [
          {
            "type": "paragraph",
            "text": "NexCV and NexBook were developed as AI-powered CV creation and appointment management systems. They offer integrated solutions for two different needs."
          },
          {
            "type": "heading",
            "text": "AI-Powered CV Builder"
          },
          {
            "type": "paragraph",
            "text": "NexCV allows users to create professional CVs with AI assistance. It offers industry-standard designs and content suggestions."
          },
          {
            "type": "heading",
            "text": "Smart Appointment System"
          },
          {
            "type": "paragraph",
            "text": "NexBook automates business appointment processes. AI that learns customer preferences suggests the most suitable appointment times."
          }
        ]
      }
    }
  ]
}
